Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Seven Years Later.tmx
Source language: en
Languages: es_419

source: After a series of mishaps, she finds herself in a strange situation - she appears to have been zapped seven years into the future in the blink of an eye.
es_419: Tras vivir una serie de percances, se encuentra en una situación un tanto extraña: parece que se teletransportó siete años en el futuro en un abrir y cerrar de ojos.

source: it's just weird...
es_419: Es raro.

source: Where are you?
es_419: Dónde estás?

source: oh right. we're buying three tickets, aren't we?
es_419: Ah, sí. Compraremos tres entradas, ¿no?

source: busy with what?
es_419: ¿Ocupada con qué?

source: I asked him...
es_419: Le pregunté…

source: The adventures of a girl out of time begin now!
es_419: ¡Ya comienzan las aventuras de una chica que está fuera de época!

source: ride with ara?
es_419: ¿Ara me tiene que llevar?

source: How old are you now?
es_419: Cuántos años tienes ahora?

source: You're also pretty, you know?
es_419: Tú también eres bonita, sabes?

source: anything?
es_419: ¿Cualquier cosa?

source: Gotta go to the bathroom.
es_419: Tengo que ir al baño.

source: I'm not sure why, but I don't think I lost my memory.
es_419: No sé por qué, pero no creo que haya perdido la memoria.

source: now I can contact gavin and ingrid.
es_419: Ahora puedo hablar con Gavin e Ingrid.

source: i didn't think she was serious since it would take a while to become a doctor.
es_419: No creí que hablara en serio porque llegar a ser médico toma mucho tiempo.

source: let's stop.
es_419: Ya basta

source: not a single thing change in my bedroom.
es_419: No veo ni un solo cambio en mi habitación.

source: I'll help you find your dad,
es_419: Te voy a ayudar a encontrar a tu papá

source: I will tell you when I'm ready?
es_419: ¿Te lo diré cuando esté listo?

source: he is still in Jakarta.
es_419: Todavía está en Jakarta.

source: ...Someone is giving me a hand.
es_419: Alguien me da la mano.

source: Then let's get going.
es_419: y nos vamos.

source: it's either we stay here while waiting for your mom...
es_419: Podemos quedarnos aquí mientras esperamos a tu mamá,

source: ezra is so kind to me...
es_419: Ezra es tan bueno conmigo…

source: Shouldn't we stay here?
es_419: ¿No sería mejor quedarnos aquí?

source: CHAPTER 3:
es_419: CAPÍTULO 3:

source: Don't just stare at me like that...
es_419: No me mires así…

source: I promised my friends to play online together.
es_419: Les prometí a mis amigos que jugaría con ellos.

source: so that we'll live in prosperity forever after!
es_419: ¡Así viviremos con lujos por siempre!

source: HAAAAA
es_419: AAAAH

source: please focus, kala!
es_419: ¡Concéntrate, Kala!

source: if he were in bandung, you wouldn't have come here, right?
es_419: Si hubiera estado en Bandung, no habrías venido, ¿verdad?

source: you're not a ghost, are you?
es_419: No eres un fantasma, ¿o sí?

source: I asked him for milk pies.
es_419: También le pedí pastel.

source: I should've listened to you.
es_419: Tendría que haberte escuchado.

source: But all my friends are go--
es_419: Pero todos mis amigos van…

source: Your mom just called me.
es_419: Tu mamá me llamó.

source: Ezra has Mr. Agung's number...
es_419: Ezra tenía el teléfono del Sr. Agung.

source: I just remember that there was a girl...
es_419: Solo recuerdo que había una chica…

source: What's the matter, Kala?
es_419: ¿Qué te pasa, Kala?

source: you know, boys develop later than girls.
es_419: Sí, los chicos se desarrollan más tarde.

source: so, how is it?
es_419: ¿Y? ¿Qué te dijo?

source: Thank you...
es_419: Gracias.

source: I would be that cougar with five male escorts!
es_419: ¡Sería como una de esas gatitas que anda con muchos chicos!

source: good to the last drop
es_419: Sabrosa hasta la última gota

source: (gotta ask again since there was no such technology in 2013)
es_419: (pregunto de nuevo porque no existía esa tecnología en el 2013)

source: Back then, they would charge you an extra fee if you sent a long message via SMS.
es_419: en aquel entonces, te cobraban un extra por enviar mensajes muy largos por SMS.

source: What if I had a heart attack?!
es_419: ¡¿Y si me da un infarto?!

source: what?
es_419: ¿Qué?

source: on our way home, gavin texted me.
es_419: De camino a casa, Gavin me envió un mensaje.

source: for me, it just happened yesterday...
es_419: para mí, todo eso pasó ayer…

source: I’ll call ara so you can calm down, okay?
es_419: Llamaré a Ara para que te calmes, ¿sí?

source: I ran away from home...
es_419: Me escapé de casa…

source: "tell us who proposed to you yesterday!"
es_419: Otros querían saber quién me propuso matrimonio ayer.

source: She taught my dad how to browse the internet.
es_419: Ella le enseñó a mi papá a navegar por internet.

source: didn't make sense, so no wonder he thought I lost my memory.
es_419: no tiene sentido, así que no me extraña que crea que perdí la memoria.

source: and he's gonna punish me.
es_419: y me va a castigar.

source: you haven't changed one bit.
es_419: No has cambiado nada.

source: TRIP
es_419: TUC

source: gavin, you should've told me!
es_419: ¿Por qué no me lo dijiste, Gavin?

source: TING
es_419: DING

source: two...
es_419: Dos…

source: I jumped seven years to 2021.
es_419: Salté siete años al futuro, al 2021.

source: Is this the bracelet you mentioned?
es_419: ¿Es este el brazalete del que hablabas?

source: ...but where is he?
es_419: ¿Pero dónde está?

source: Hmm?
es_419: ¿Mmm?

source: Ew, it's frustrating to see those two.
es_419: Puaj, qué frustración verlos a esos dos.

source: The one who put those pictures on the wall was Ezra's mom.
es_419: La mamá de Ezra fue quien puso todas esas fotos en la pared.

source: He did.
es_419: Él me contó.

source: Wow, that sounds so 2021.
es_419: Guau, eso es tan 2021.

source: Wait,
es_419: Espera,

source: she's busy.
es_419: Está ocupada.

source: if we bought at least ten coins in 2013 and sold them in 2021...
es_419: Si compramos al menos diez monedas en 2013 y las vendemos en 2021…

source: she claims to be a time traveler!
es_419: ¡Dice que puede viajar en el tiempo!

source: I'm Kala, and I'm 17 years old.
es_419: Me llamo Kala y tengo 17 años.

source: sir...
es_419: Señor…

source: you suddenly went missing.
es_419: pero tú desapareciste de repente.

source: You haven't been to the beach since you were little, have you?
es_419: No vas a la playa desde que eras una niña, ¿no es así?

source: I'm sure he'll understand.
es_419: Estoy seguro de que va a entender.

source: You didn't go missing again, did you?
es_419: No te perdiste de nuevo, ¿no?

source: I'm... not ready for this...
es_419: No… no estoy lista para esto.

source: don't treat your sister that way!
es_419: ¡No trates así a tu hermana!

source: how come?
es_419: ¿Por qué?

source: you're not going to finish that?
es_419: ¿No vas a terminar eso?

source: I'd worry too much.
es_419: me preocuparía mucho.

source: I wonder if my friends are at the airport right now, getting ready to leave for Bali.
es_419: Me pregunto si mis amigos ya están en el aeropuerto, si ya están listos para irse a Bali.

source: Good morning.
es_419: Buenos días.

source: oh... it wasn't funny...
es_419: Ah… No fue gracioso…

source: who is she that you can say such a thing?
es_419: ¿Quién es ella para que te atrevas a decir una cosa así?

source: iNGRID AGE 17 KALA'S BEST FRIEND
es_419: INGRID 17 AÑOS MEJOR AMIGA DE KALA

source: But you're a girl!
es_419: ¡Pero eres menor de edad!

source: I'm fine...
es_419: Estoy bien.

source: I remember hearing about it from the news on TV...
es_419: Me acuerdo haber oído algo de esto en la televisión.

source: yeah, I've watched some of your videos.
es_419: Sí, vi algunos de tus videos.

source: she wouldn't have gone missing that day.
es_419: no habría desaparecido ese día.

source: I must be braver...
es_419: Debo ser más valiente

source: and you'll have to go home with her as well, understand?
es_419: Y tendrás que volver a casa con ella, ¿está claro?

source: I promise.
es_419: Lo prometo.

source: gavin has told me about you.
es_419: Gavin me habló de ti.

source: had I grabbed her hand tighter,
es_419: Si tan solo la hubiera agarrado más fuerte,

source: why is he not replying?
es_419: ¿Por qué no me responde?

source: STONKS
es_419: ACCIONES

source: Don't worry, I'll get scolded too.
es_419: No pasa nada. A mí también me va a regañar.

source: What are you doing here?
es_419: ¿Qué haces aquí?

source: I'm sorry I couldn't be a good daughter to you.
es_419: Perdóname por no haber sido una buena hija.

source: Do you understand what I'm saying?
es_419: ¿Entiendes algo de lo que te digo?

source: if you want to go back, you need to focus on the person who was with you .
es_419: Si quieres volver, tienes que concentrarte en la persona que estaba contigo.

source: seven years ago, I was also in bali to celebrate new year's eve.
es_419: Hace siete años también fui a Bali para celebrar Año Nuevo.

source: and it all changed overnight.
es_419: De que todo cambió de un día para el otro.

source: I can't believe the statue was completed in 2021!
es_419: ¡No puedo creer que esté terminada en el 2021!

source: so that dad won’t be angry with me.
es_419: Así papá no se enojará conmigo.

source: PFFT
es_419: PFFF

source: Stop bothering me, please!
es_419: ¡Ya deja de molestarme, por favor!

source: But now you're so skinny.
es_419: Pero ahora eres tan flaquito.

source: here...
es_419: Toma…

source: And I can't ask for the answer since she's no longer here...
es_419: Y no puedo preguntar lo que significan porque ella ya no está.

source: yeah.
es_419: Sip.

source: Here, have some water.
es_419: Toma, bebe agua.

source: I was so scared, ezra
es_419: Tenía mucho miedo, Ezra.

source: don't want to lose you again...
es_419: No quiero volver a perderte…

source: I'll have boba milk tea for a week!
es_419: ¡Quiero té de burbujas una semana entera!

source: you were about seven years old in 2003, right?
es_419: En 2003 tenías unos 7 años, ¿cierto?

source: they said if you leave a love lock there...
es_419: Dicen que si dejas uno de esos…

source: back then, each botcoin was worth a hundred thousand rupiahs.*
es_419: En aquel entonces, cada bitcoin valía 100 mil rupias.*

source: wait here, I need to check in.
es_419: Quédense aquí. Voy a hacer el registro.

source: take that back!
es_419: ¡No digas eso!

source: I may be troublesome...
es_419: Tal vez sí sea un problema…

source: You already know she's his girlfriend?
es_419: Ya sabes que es su novia entonces?

source: Bandung… I'm from Bandung.
es_419: Bandung… Soy de Bandung.

source: Just don't forget to introduce me to your foreign friends.
es_419: No te olvides de presentarme a tus amigos extranjeros.

source: ...what's changed in the past seven years.
es_419: … en todo lo que cambió en estos últimos siete años.

source: 100 for biology.
es_419: 100 en biología.

source: click
es_419: CLIC

source: Only Ezra would answer that kind of weird question...
es_419: Solo Ezra podría contestar una pregunta tan rara como esa…

source: grumble
es_419: Refunfuña

source: You mean Grandma Sukma?
es_419: ¿Te refieres a la abuela Sukma?

source: can you stand up, sir?
es_419: ¿Puede levantarse, señor?

source: you really can travel through time?
es_419: ¿Es verdad que puedes viajar en el tiempo?

source: oh...
es_419: Ah…

source: judging from your cheerfulness, you must be fine.
es_419: O eso parece. Te veo muy animada.

source: Actually...
es_419: En realidad…

source: Last night, when you went missing at the restaurant,
es_419: Anoche, cuando te perdiste en el restaurante.

source: Excuse me, I need to wash my hands.
es_419: Disculpa, tengo que lavarme las manos.

source: TEDDY KALA'S DAD
es_419: TEDDY PAPÁ DE KALA

source: I feel like something's missing...
es_419: Siento que falta algo…

source: ingrid's mom will try to talk with my parents.
es_419: la mamá de Ingrid va a tratar de hablar con mis papás.

source: She always calls me whenever she uses her smartphone because she's not tech-savvy.
es_419: Siempre me llama cada vez que usa su smartphone porque no sabe usar muy bien la tecnología.

source: luckily, I won! if I lost, I'd blame you!
es_419: ¡Por suerte gané! ¡Si perdía, te iba a echar la culpa!

source: WOOOooW.
es_419: Guaauu.

source: THE MOST LONG-LASTING LIPSTICK EVER
es_419: EL LÁPIZ LABIAL MÁS RESISTENTE DEL MUNDO

source: Written by
es_419: Escrito por

source: Please stop crying, Ara.
es_419: Deja de llorar, Ara.

source: Don't remember it.
es_419: No lo recuerdes.

source: what does it look like?
es_419: ¿Cómo es?

source: Besides, it's 2021,
es_419: Además, estamos en el 2021.

source: everyone kept asking about you while you were gone.
es_419: No dejaban de preguntar por ti cuando te fuiste.

source: is this how you talk to your...
es_419: ¿Es así cómo tratas a tu…

source: that I travel through time.
es_419: Y que viajo en el tiempo.

source: Would you free yourself?
es_419: ¿Te liberarías de esas cadenas?

source: I just feel guilty.
es_419: Es que me da culpa.

source: all right?
es_419: ¿estás bien?

source: what, you named that cat...
es_419: ¿Qué? Ese gato se llama…

source: Why do you have this?
es_419: ¿Por qué tienes esto?

source: Ah, I'm full...
es_419: Ay, estoy llena.

source: yes!
es_419: ¡Sí!

source: ...I don't know what's happening to me...
es_419: No sé que me está pasando.

source: your style is so different from the Gavin that I knew!!!
es_419: ¡¡Tu estilo es muy diferente al del Gavin que conozco!!

source: Think about your national exam, will you?!
es_419: ¿Es que no vas a pensar en tus exámenes nacionales?

source: I can't stop thinking about my dad.
es_419: no puedo dejar de pensar en mi papá.

source: ...All my final exam scores are bad.
es_419: … todas las notas de mis exámenes finales son malas.

source: older sister?
es_419: hermana mayor?

source: it's just...
es_419: Es que…

source: My sister Ara is the best at using computers and cellphones.
es_419: Mi hermana, Ara, es la que mejor sabe usar las computadoras y los celulares.

source: *a toxic relationship: an unhealthy relationship. may be between family members, friends, or lovers.
es_419: *Una relación tóxica: una relación poco saludable. Puede ocurrir entre familiares, amigos o amantes.

source: at first, it felt awkward,
es_419: Al principio era raro…

source: Two days?
es_419: ¿Dos días?

source: ...why did you take me out as if you were still in love with me?
es_419: … ¿por qué me sacaste a pasear como si aún estuvieras enamorado de mí?

source: I see... that's okay.
es_419: Ya veo… Está bien.

source: yeah!
es_419: ¡Sí!

source: so, the person who gave you this bracelet is connected to that dead girl?
es_419: Entonces, ¿la persona que te dio ese brazalete está conectada con esa chica muerta?

source: she said...
es_419: Me dijo…

source: CLENCH
es_419: APRIETA

source: haha Yeah, why?
es_419: Ja, ja. Sí, ¿por qué?

source: well, except for Mom...
es_419: Bueno, excepto mamá…

source: My mom's the same way.
es_419: Mi mamá es igual.

source: you're fine, right?
es_419: Estás bien, ¿no?

source: come on, have a seat next to me.
es_419: Vamos, siéntate aquí conmigo.

source: I wouldn't be mad or anything.
es_419: No me enojaría ni nada por el estilo.

source: I knew that you hated bali.
es_419: Sabía que odiabas Bali.

source: I'm sorry I left you all day!
es_419: ¡Perdón por dejarte sola todo el día!

source: since when do you like drumsticks?!
es_419: ¡¿Desde cuándo te gustan los muslos?!

source: it's because of time.
es_419: Por el paso del tiempo.

source: it's just a couple minutes away from here.
es_419: Están a un par de minutos de aquí.

source: what do you mean?
es_419: ¿Qué quieres decir?

source: I was told to focus, and I really wanted to see you...
es_419: Me dijeron que me concentrara, y de verdad quería verte.

source: CHAPTER 9:
es_419: CAPÍTULO 9:

source: What, you can surf?!
es_419: ¿Qué? ¡¿Sabes surfear?!

source: so heavy...
es_419: Pesa mucho.

source: ...And I keep counting...
es_419: Y sigo contando…

source: Are you hungry?
es_419: ¿Tienes hambre?

source: she remembers that you dreamed of starting a clinic with her before the final exam. so it must be really her.
es_419: Se acordaba de cuando querían abrir una clínica juntas antes del examen final, así que debe ser ella.

source: maybe a little taller or something...
es_419: Y ser un poco más alta o algo…

source: I don't know what's happening to me...
es_419: No sé que me está pasando.

source: he still keeps his bracelet with him!
es_419: ¡Todavía tiene el brazalete!

source: Once Dad got home, I was going to ask his permission to go with my friends...
es_419: Cuando papá llegue a casa le voy a pedir permiso para poder ir con mis amigos.

source: but I was too afraid to know the truth.
es_419: pero me daba miedo saber la verdad.

source: I remember there's this guy from another class who wants to come along...
es_419: Creo que había un chico de otra clase que también quería venir con nosotros…

source: I don’t know how to respond...
es_419: No sé qué decir…

source: So?
es_419: ¿Y?

source: ezra told him everything, including my time-traveling thing.
es_419: Ezra le contó todo, incluso lo de que puedo viajar en el tiempo.

source: even though they said it's been seven years...
es_419: Aunque digan que pasaron siete años…

source: pull yourself together, kala!
es_419: ¡Contrólate, Kala!

source: go open it.
es_419: Ve a abrir.

source: about what happened...
es_419: lo que pasó…

source: Ezra's flight was delayed to tomorrow?
es_419: ¿El vuelo de Ezra se retrasó hasta mañana?

source: HMM?
es_419: ¿MMM?

source: ...SEVEN YEARS.
es_419: SIETE AÑOS.

source: He won't be worried if we go together.
es_419: Si vamos juntos no se preocupará.

source: LOST AND FOUND
es_419: REAPARECIDA

source: I'm so happy!
es_419: ¡Qué felicidad!

source: what should I reply to him?!
es_419: ¡¿Qué le respondo?!

source: it's my job to serve and protect.
es_419: Es mi trabajo servir y proteger.

source: no! you'll have trouble sleeping!
es_419: ¡No! ¡Después no vas a poder dormir!

source: that's what I told you.
es_419: Eso es lo que te dije.
